---
kind: method
id: M:Autodesk.Revit.DB.Element.GetMonitoredLocalElementIds
zh: 构件、图元、元素
source: html/47ca1e8c-f79d-a18b-505b-73a4358d2264.htm
---
# Autodesk.Revit.DB.Element.GetMonitoredLocalElementIds Method

**中文**: 构件、图元、元素

Provides the local element IDs when the element is monitoring.

## Syntax (C#)
```csharp
public IList<ElementId> GetMonitoredLocalElementIds()
```

## Returns
The IDs of local element IDs being monitored by this element.